**01: Introduction to Pandas DataFrame**

In [42]:
import pandas as pd

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

*Syntax:* `pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)`\
*Most commonly used syntax:* `pandas.DataFrame(data)` or `pandas.DataFrame(data, index)`

**None => optional*

Create a data dictionary

In [43]:
# intialise data of lists.
data = {'Name':['Isaac', 'Albert', 'Marie', 'Stephen','Meghnad','Kamala'],
        'Age':[20, 50, 19, 18, 32,  23],
        'Marks':[40, 90, 50, 20, 65, 86]
        }

Create a `DataFrame`

In [44]:
# Create DataFrame
df = pd.DataFrame(data)
 
print('Dataframe:')
df

Dataframe:

      Name  Age  Marks
0    Isaac   20     40
1   Albert   50     90
2    Marie   19     50
3  Stephen   18     20
4  Meghnad   32     65
5   Kamala   23     86

**Head and Tail**

Syntax: df.head(n) -> returns first n rows 
                   -> n=5 if not mentioned
                   -> if n < 0, then all rows except last n rows

Syntax: df.tail(n) -> returns lastt n rows 
                   -> n=5 if not mentioned
                   -> if n < 0, then all rows except first n rows

In [45]:
print(df.head())
print(df.head(-3))
df.head(2)

      Name  Age  Marks
0    Isaac   20     40
1   Albert   50     90
2    Marie   19     50
3  Stephen   18     20
4  Meghnad   32     65
     Name  Age  Marks
0   Isaac   20     40
1  Albert   50     90
2   Marie   19     50

     Name  Age  Marks
0   Isaac   20     40
1  Albert   50     90

In [46]:
print(df.tail())
df.tail(2)

      Name  Age  Marks
1   Albert   50     90
2    Marie   19     50
3  Stephen   18     20
4  Meghnad   32     65
5   Kamala   23     86

      Name  Age  Marks
4  Meghnad   32     65
5   Kamala   23     86

In [47]:
df['Age']

0    20
1    50
2    19
3    18
4    32
5    23
Name: Age, dtype: int64

In [48]:
df.Marks

0    40
1    90
2    50
3    20
4    65
5    86
Name: Marks, dtype: int64

**Save data to a .csv file**

In [54]:
#df.to_csv('marks.csv', encoding='utf-8', index=False)
df.to_csv('marks.csv', index=False) # if index=False not set,
                                 # extra index column (`Unnamed 0`) may appear


# Read again
df2 = pd.read_csv("marks.csv")
df2

      Name  Age  Marks
0    Isaac   20     40
1   Albert   50     90
2    Marie   19     50
3  Stephen   18     20
4  Meghnad   32     65
5   Kamala   23     86